# GradientBackgroundSettings Properties

---
The GradientBackgroundSettings type exposes the following members.
| Name| Description
---|---|---
| GroundColor|  The color of the ground.
| HorizonColor|  The color of the horizon.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from BackgroundSettings)
| SkyColor|  The color of the top of the sky.
Top
#### Reference
GradientBackgroundSettings Class
Autodesk.Revit.DB Namespace